RIET/src/Documents/BatchesOfCustomsFiles/BatchesOfCustomsFiles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>BatchesOfCustomsFiles</name>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.CountriesOfProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>SoldTo</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬSakhalin</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CCDs</name>
    <attributes>
      <name>CCD</name>
      <type>
        <types>DocumentRef.ГТД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CustomsFilesOfTemporaryImportExport</name>
    <attributes>
      <name>CustomsFile</name>
      <type>
        <types>DocumentRef.ГТД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТПО</name>
    <attributes>
      <name>ТПО</name>
      <type>
        <types>DocumentRef.CustomsFilesLight</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CustomsBonds</name>
    <attributes>
      <name>CustomsBond</name>
      <type>
        <types>DocumentRef.CustomsFilesLight</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CustomsBondClosings</name>
    <attributes>
      <name>CustomsBondClosing</name>
      <type>
        <types>DocumentRef.CustomsFilesLight</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Enums/TypesOfCustomsFileLightTransaction/TypesOfCustomsFileLightTransaction.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TypesOfCustomsFileLightTransaction</name>
  <enumValues>
    <name>CustomsFileLight</name>
  </enumValues>
  <enumValues>
    <name>ТПО</name>
  </enumValues>
  <enumValues>
    <name>CustomsBond</name>
  </enumValues>
  <enumValues>
    <name>CustomsBondClosing</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Documents/ЗакрытиеПоставки/ЗакрытиеПоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакрытиеПоставки</name>
  <basedOn>Document.Поставка</basedOn>
  <basedOn>Document.ExportShipment</basedOn>
  <basedOn>Document.TemporaryImpExpTransactions</basedOn>
  <registerRecords>AccumulationRegister.ExportItemsWithoutCustomsFiles</registerRecords>
  <registerRecords>InformationRegister.CustomsFilesOfGoods</registerRecords>
  <registerRecords>AccumulationRegister.QtyOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>InformationRegister.ExpiryDatesOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.InternationalAndDomesticFactCosts</registerRecords>
  <registerRecords>InformationRegister.AdditionalDataOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.ImportItemsWithoutCustomsFiles</registerRecords>
  <registerRecords>InformationRegister.ResponsiblesForItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.InvoiceLinesCosts</registerRecords>
  <attributes>
    <name>Поставка</name>
    <type>
      <types>DocumentRef.TemporaryImpExpTransactions</types>
      <types>DocumentRef.ExportShipment</types>
      <types>DocumentRef.Поставка</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретОбменаРИЕТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сопоставление</name>
    <attributes>
      <name>СтрокаИнвойса</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>ТоварСтрокиГТД</name>
      <type>
        <types>CatalogRef.ТоварыСтрокГТД</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Documents/CustomsFilesLight/CustomsFilesLight.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CustomsFilesLight</name>
  <comment>Декларация на товары (легкая версия) / Таможенный приходный ордер</comment>
  <basedOn>Document.Поставка</basedOn>
  <basedOn>Document.ExportShipment</basedOn>
  <basedOn>Document.CustomsFilesLight</basedOn>
  <basedOn>Document.ГТД</basedOn>
  <registerRecords>AccumulationRegister.ExportItemsWithoutCustomsFiles</registerRecords>
  <registerRecords>AccumulationRegister.ItemsWithoutCVCDecision</registerRecords>
  <registerRecords>AccumulationRegister.CustomsDeposits</registerRecords>
  <registerRecords>InformationRegister.CustomsFilesOfGoods</registerRecords>
  <registerRecords>AccumulationRegister.QtyOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.НеоплаченныеТПО</registerRecords>
  <registerRecords>InformationRegister.ExpiryDatesOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.CustomsDepositsToRefund</registerRecords>
  <registerRecords>AccumulationRegister.InternationalAndDomesticFactCosts</registerRecords>
  <registerRecords>InformationRegister.AdditionalDataOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.ImportItemsWithoutCustomsFiles</registerRecords>
  <registerRecords>InformationRegister.ResponsiblesForItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьТоваровПоТПО</registerRecords>
  <registerRecords>AccumulationRegister.InvoiceLinesCosts</registerRecords>
  <attributes>
    <name>TypeOfTransaction</name>
    <type>
      <types>EnumRef.TypesOfCustomsFileLightTransaction</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsPost</name>
    <type>
      <types>CatalogRef.CustomsPosts</types>
    </type>
  </attributes>
  <attributes>
    <name>SeqNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SoldTo</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </attributes>
  <attributes>
    <name>CCA</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>ImportExport</name>
    <type>
      <types>EnumRef.ИмпортЭкспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>PermanentTemporary</name>
    <type>
      <types>EnumRef.PermanentTemporary</types>
    </type>
  </attributes>
  <attributes>
    <name>Regime</name>
    <type>
      <types>CatalogRef.CustomsRegimes</types>
    </type>
  </attributes>
  <attributes>
    <name>PSAContract</name>
    <type>
      <types>CatalogRef.PSAContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceCurrency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceCurrencyRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomsValue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReleaseDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpiryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Shipment</name>
    <type>
      <types>DocumentRef.ExportShipment</types>
      <types>DocumentRef.Поставка</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsFile</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsBond</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsDepositAmountToRefund</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоПоГрафеВ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaidByCCA</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.CountriesOfProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsDepositRefundTo</name>
    <type>
      <types>EnumRef.CustomsDepositsRefundTo</types>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ССD</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>CustomsFileHTC</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CustomsFileNetWeight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Type</name>
      <comment>RGS - Используется для TKG</comment>
      <type>
        <types>CatalogRef.ТипыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Goods</name>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceTotalValue</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceLine</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>POLine</name>
      <type>
        <types>CatalogRef.СтрокиЗаявкиНаЗакупку</types>
      </type>
    </attributes>
    <attributes>
      <name>DescriptionForCustoms</name>
      <type>
        <types>EnumRef.DescriptionForCustoms</types>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceCorrectionValue</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Payments</name>
    <attributes>
      <name>PaymentKind</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Sum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaidByCCA</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>InTheSetoffCustomsDeposit</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Documents/BatchesOfCustomsFiles/ObjectModule.bsl
//////////////////////////////////////////////////////////////////
// ОБРАБОТКА ЗАПОЛНЕНИЯ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипЗнчДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ТипЗнчДанныхЗаполнения = Тип("Структура") Тогда
		
		ДанныеЗаполнения.Свойство("Country", Country);
		ДанныеЗаполнения.Свойство("ProcessLevel", ProcessLevel);
		ДанныеЗаполнения.Свойство("SoldTo", SoldTo);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ProcessLevel) Тогда
		ProcessLevel = РГСофтСерверПовтИспСеанс.ПолучитьЗначениеРеквизита(ПараметрыСеанса.ТекущийПользователь, "ProcessLevel");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Country) И ЗначениеЗаполнено(ProcessLevel) Тогда
		Country = РГСофтСерверПовтИспСеанс.ПолучитьЗначениеРеквизита(ProcessLevel, "Country");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(SoldTo) И ЗначениеЗаполнено(Country) Тогда
		SoldTo = ImportExportСерверПовтИспСеанс.ПолучитьLegalEntityOfCountry(Country);
	КонецЕсли;

КонецПроцедуры


//////////////////////////////////////////////////////////////////
// ПЕРЕД ЗАПИСЬЮ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДозаполнитьРеквизитыБезДополнительныхДанных();
	
	ПроверитьРеквизитыБезДополнительныхДанных(Отказ, РежимЗаписи);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПоместитьВДополнительныеСвойстваДополнительныеДанныеПередЗаписью(РежимЗаписи);
		
	ПроверитьРеквизитыСДополнительнымиДанными(Отказ, РежимЗаписи);
			
КонецПроцедуры

Процедура ДозаполнитьРеквизитыБезДополнительныхДанных()
	
	Если ЭтоНовый() Тогда
		РГСофт.ЗаполнитьCreation(ЭтотОбъект);
	КонецЕсли;
		
	Comment = СокрЛП(Comment);
	
	CCDs.Свернуть("CCD", "");
	ОбщегоНазначения.ОчиститьТаблицуОтСтрокСПустымиРеквизитами(CCDs, "CCD");

	ТПО.Свернуть("ТПО", "");
	ОбщегоНазначения.ОчиститьТаблицуОтСтрокСПустымиРеквизитами(ТПО, "ТПО");
	
	CustomsFilesOfTemporaryImportExport.Свернуть("CustomsFile", "");
	ОбщегоНазначения.ОчиститьТаблицуОтСтрокСПустымиРеквизитами(CustomsFilesOfTemporaryImportExport, "CustomsFile");
	
	CustomsBonds.Свернуть("CustomsBond", "");
	ОбщегоНазначения.ОчиститьТаблицуОтСтрокСПустымиРеквизитами(CustomsBonds, "CustomsBond");
	
	CustomsBondClosings.Свернуть("CustomsBondClosing", "");
	ОбщегоНазначения.ОчиститьТаблицуОтСтрокСПустымиРеквизитами(CustomsBondClosings, "CustomsBondClosing");
	
КонецПроцедуры

Процедура ПроверитьРеквизитыБезДополнительныхДанных(Отказ, РежимЗаписи)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Date' is empty!",
			ЭтотОбъект, "Дата", , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Country) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Country' is empty!",
			ЭтотОбъект, "Country", , Отказ);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ProcessLevel) Тогда
		
		ProcessLevelCountry = РГСофтСерверПовтИспСеанс.ПолучитьЗначениеРеквизита(ProcessLevel, "Country");
		Если ProcessLevelCountry <> Country Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Country '" + СокрЛП(ProcessLevelCountry) + "' of Process level differs from Country '" + СокрЛП(Country) + "' of the Batch!",
				ЭтотОбъект, "ProcessLevel", , Отказ);
		КонецЕсли;
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Process level' is empty!",
			ЭтотОбъект, "ProcessLevel", , Отказ);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(SoldTo) Тогда
		
		ParentCompanyCountry = РГСофтСерверПовтИспСеанс.ПолучитьЗначениеРеквизита(SoldTo, "Country");
		Если ParentCompanyCountry <> Country Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Country '" + СокрЛП(ParentCompanyCountry) + "' of Legal entity differs from Country '" + СокрЛП(Country) + "' of the Batch!",
				ЭтотОбъект, "SoldTo", , Отказ);
		КонецЕсли;
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Parent company' is empty!",
			ЭтотОбъект, "SoldTo", , Отказ);	
	КонецЕсли;
	
	Если РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	Если Дата > ТекущаяДата() + 8 * 60 * 60 Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Date' can not be later than the current date!",
			ЭтотОбъект, "Дата", , Отказ);		
	КонецЕсли;
	
	Если CCDs.Количество() = 0 И ТПО.Количество() = 0 И CustomsFilesOfTemporaryImportExport.Количество() = 0 
		И CustomsBonds.Количество() = 0 И CustomsBondClosings.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Tables are empty!",
			ЭтотОбъект, , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоместитьВДополнительныеСвойстваДополнительныеДанныеПередЗаписью(РежимЗаписи)
	
	СтруктураПараметров = Новый Структура;
	СтруктураТекстов = Новый Структура;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		// реквизиты Customs files
		AllCustomsFiles = CCDs.ВыгрузитьКолонку("CCD");
		AllCustomsFiles = РГСофтКлиентСервер.СложитьМассивы(AllCustomsFiles, CustomsFilesOfTemporaryImportExport.ВыгрузитьКолонку("CustomsFile"));
		Если AllCustomsFiles.Количество() Тогда
			
			СтруктураПараметров.Вставить("AllCustomsFiles", AllCustomsFiles);	
			СтруктураТекстов.Вставить("РеквизитыCustomsFiles",
				"ВЫБРАТЬ
				|	CustomsFiles.Ссылка КАК CustomsFile,
				|	CustomsFiles.Проведен,
				|	CustomsFiles.Дата,
				|	CustomsFiles.ProcessLevel,
				|	CustomsFiles.SoldTo КАК ParentCompany,
				|	CustomsFiles.CustomsPost.Customs КАК Customs,
				|	CustomsFiles.CustomsPost.Customs.LawsonContractor КАК LawsonContractor,
				|	CustomsFiles.Shipment,
				|	InvoiceLinesMatchings.Ссылка КАК InvoiceLinesMatching
				|ИЗ
				|	Документ.ГТД КАК CustomsFiles
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗакрытиеПоставки КАК InvoiceLinesMatchings
				|		ПО CustomsFiles.Shipment = InvoiceLinesMatchings.Поставка
				|			И (CustomsFiles.Проведен)
				|ГДЕ
				|	CustomsFiles.Ссылка В(&AllCustomsFiles)");
	
		КонецЕсли;
		
		// реквизиты Customs files light
		AllCustomsFilesLight = ТПО.ВыгрузитьКолонку("ТПО");
		AllCustomsFilesLight = РГСофтКлиентСервер.СложитьМассивы(AllCustomsFilesLight, CustomsBonds.ВыгрузитьКолонку("CustomsBond"));
		AllCustomsFilesLight = РГСофтКлиентСервер.СложитьМассивы(AllCustomsFilesLight, CustomsBondClosings.ВыгрузитьКолонку("CustomsBondClosing"));
		Если AllCustomsFilesLight.Количество() Тогда
			
			СтруктураПараметров.Вставить("AllCustomsFilesLight", AllCustomsFilesLight);	
			СтруктураТекстов.Вставить("РеквизитыCustomsFilesLight",
				"ВЫБРАТЬ
				|	CustomsFilesLight.Ссылка КАК CustomsFileLight,
				|	CustomsFilesLight.Проведен,
				|	CustomsFilesLight.Дата,
				|	CustomsFilesLight.ProcessLevel,
				|	CustomsFilesLight.SoldTo КАК ParentCompany,
				|	CustomsFilesLight.CustomsPost.Customs КАК Customs,
				|	CustomsFilesLight.CustomsPost.Customs.LawsonContractor КАК LawsonContractor,
				|	CustomsFilesLight.TypeOfTransaction,
				|	""InvoiceLinesMatching"" КАК InvoiceLinesMatching
				|ИЗ
				|	Документ.CustomsFilesLight КАК CustomsFilesLight
				|ГДЕ
				|	CustomsFilesLight.Ссылка В(&AllCustomsFilesLight)");
		
		КонецЕсли;
		
		СтруктураПараметров.Вставить("Ссылка", Ссылка);
		
		// дубли по Customs files
		Если CCDs.Количество() > 0 Тогда
			
			СтруктураПараметров.Вставить("CustomsFiles", CCDs.ВыгрузитьКолонку("CCD"));
			СтруктураТекстов.Вставить("CustomsFilesInOtherBatches",
				"ВЫБРАТЬ
				|	BatchesOfCustomsFilesCustomsFiles.CCD,
				|	BatchesOfCustomsFilesCustomsFiles.Ссылка.Представление КАК BatchOfCustomsFilesПредставление
				|ИЗ
				|	Документ.BatchesOfCustomsFiles.CCDs КАК BatchesOfCustomsFilesCustomsFiles
				|ГДЕ
				|	BatchesOfCustomsFilesCustomsFiles.Ссылка <> &Ссылка
				|	И НЕ BatchesOfCustomsFilesCustomsFiles.Ссылка.ПометкаУдаления
				|	И BatchesOfCustomsFilesCustomsFiles.CCD В(&CustomsFiles)");
			
		КонецЕсли;
		
		// дубли по Customs files of temporary imp. / exp.
		Если CustomsFilesOfTemporaryImportExport.Количество() > 0 Тогда
				
			СтруктураПараметров.Вставить("CustomsFilesOfTemporaryImportExport", CustomsFilesOfTemporaryImportExport.ВыгрузитьКолонку("CustomsFile"));			
			СтруктураТекстов.Вставить("CustomsFilesOfTemporaryImportExportInOtherBatches",
				"ВЫБРАТЬ
				|	BatchesOfCustomsFilesCustomsFiles.CustomsFile,
				|	BatchesOfCustomsFilesCustomsFiles.Ссылка.Представление КАК BatchOfCustomsFilesПредставление
				|ИЗ
				|	Документ.BatchesOfCustomsFiles.CustomsFilesOfTemporaryImportExport КАК BatchesOfCustomsFilesCustomsFiles
				|ГДЕ
				|	BatchesOfCustomsFilesCustomsFiles.Ссылка <> &Ссылка
				|	И НЕ BatchesOfCustomsFilesCustomsFiles.Ссылка.ПометкаУдаления
				|	И BatchesOfCustomsFilesCustomsFiles.CustomsFile В(&CustomsFilesOfTemporaryImportExport)");
			
		КонецЕсли;

		// дубли по Customs receipt orders
		Если ТПО.Количество() > 0 Тогда
				
			СтруктураПараметров.Вставить("CustomsReceiptOrders", ТПО.ВыгрузитьКолонку("ТПО"));		
			СтруктураТекстов.Вставить("CustomsReceiptOrdersInOtherBatches",
				"ВЫБРАТЬ
				|	BatchesOfCustomsFilesCustomsReceiptOrders.ТПО,
				|	BatchesOfCustomsFilesCustomsReceiptOrders.Ссылка.Представление КАК BatchOfCustomsFilesПредставление
				|ИЗ
				|	Документ.BatchesOfCustomsFiles.ТПО КАК BatchesOfCustomsFilesCustomsReceiptOrders
				|ГДЕ
				|	BatchesOfCustomsFilesCustomsReceiptOrders.Ссылка <> &Ссылка
				|	И НЕ BatchesOfCustomsFilesCustomsReceiptOrders.Ссылка.ПометкаУдаления
				|	И BatchesOfCustomsFilesCustomsReceiptOrders.ТПО В(&CustomsReceiptOrders)");
			
		КонецЕсли;
		
		// дубли по Customs bonds
		Если CustomsBonds.Количество() > 0 Тогда
				
			СтруктураПараметров.Вставить("CustomsBonds", CustomsBonds.ВыгрузитьКолонку("CustomsBond"));				
			СтруктураТекстов.Вставить("CustomsBondsInOtherBatches",
				"ВЫБРАТЬ
				|	BatchesOfCustomsFilesCustomsBonds.CustomsBond,
				|	BatchesOfCustomsFilesCustomsBonds.Ссылка.Представление КАК BatchOfCustomsFilesПредставление
				|ИЗ
				|	Документ.BatchesOfCustomsFiles.CustomsBonds КАК BatchesOfCustomsFilesCustomsBonds
				|ГДЕ
				|	BatchesOfCustomsFilesCustomsBonds.Ссылка <> &Ссылка
				|	И НЕ BatchesOfCustomsFilesCustomsBonds.Ссылка.ПометкаУдаления
				|	И BatchesOfCustomsFilesCustomsBonds.CustomsBond В(&CustomsBonds)");
			
		КонецЕсли;

		// дубли по Customs bond closings
		Если CustomsBondClosings.Количество() > 0 Тогда
				
			СтруктураПараметров.Вставить("CustomsBondClosings", CustomsBondClosings.ВыгрузитьКолонку("CustomsBondClosing"));				
			СтруктураТекстов.Вставить("CustomsBondClosingsInOtherBatches",
				"ВЫБРАТЬ
				|	BatchesOfCustomsFilesCustomsBondClosings.CustomsBondClosing,
				|	BatchesOfCustomsFilesCustomsBondClosings.Ссылка.Представление КАК BatchOfCustomsFilesПредставление
				|ИЗ
				|	Документ.BatchesOfCustomsFiles.CustomsBondClosings КАК BatchesOfCustomsFilesCustomsBondClosings
				|ГДЕ
				|	BatchesOfCustomsFilesCustomsBondClosings.Ссылка <> &Ссылка
				|	И НЕ BatchesOfCustomsFilesCustomsBondClosings.Ссылка.ПометкаУдаления
				|	И BatchesOfCustomsFilesCustomsBondClosings.CustomsBondClosing В(&CustomsBondClosings)");
			
		КонецЕсли;

	КонецЕсли; 	
	
	УстановитьПривилегированныйРежим(Истина);
	СтруктураРезультатов = РГСофт.ПолучитьСтруктуруРезультатовТекстовЗапросов(СтруктураТекстов, СтруктураПараметров);
	
	ДополнительныеСвойства.Вставить("ТаблицаРеквизитовCustomsFiles", Неопределено);
	Если СтруктураРезультатов.Свойство("РеквизитыCustomsFiles") Тогда
		ДополнительныеСвойства.ТаблицаРеквизитовCustomsFiles = СтруктураРезультатов.РеквизитыCustomsFiles.Выгрузить();
		ДополнительныеСвойства.ТаблицаРеквизитовCustomsFiles.Индексы.Добавить("CustomsFile");
	КонецЕсли;

	ДополнительныеСвойства.Вставить("ТаблицаРеквизитовCustomsFilesLight", Неопределено);
	Если СтруктураРезультатов.Свойство("РеквизитыCustomsFilesLight") Тогда
		ДополнительныеСвойства.ТаблицаРеквизитовCustomsFilesLight = СтруктураРезультатов.РеквизитыCustomsFilesLight.Выгрузить();
		ДополнительныеСвойства.ТаблицаРеквизитовCustomsFilesLight.Индексы.Добавить("CustomsFileLight");
	КонецЕсли;

	ДополнительныеСвойства.Вставить("ТаблицаCustomsFilesInOtherBatches", Неопределено);
	Если СтруктураРезультатов.Свойство("CustomsFilesInOtherBatches") Тогда
		ДополнительныеСвойства.ТаблицаCustomsFilesInOtherBatches = СтруктураРезультатов.CustomsFilesInOtherBatches.Выгрузить();
		ДополнительныеСвойства.ТаблицаCustomsFilesInOtherBatches.Индексы.Добавить("CCD");
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ТаблицаCustomsFilesOfTemporaryImportExportInOtherBatches", Неопределено);
	Если СтруктураРезультатов.Свойство("CustomsFilesOfTemporaryImportExportInOtherBatches") Тогда
		ДополнительныеСвойства.ТаблицаCustomsFilesOfTemporaryImportExportInOtherBatches = СтруктураРезультатов.CustomsFilesOfTemporaryImportExportInOtherBatches.Выгрузить();
		ДополнительныеСвойства.ТаблицаCustomsFilesOfTemporaryImportExportInOtherBatches.Индексы.Добавить("CustomsFile");
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ТаблицаCustomsReceiptOrdersInOtherBatches", Неопределено);
	Если СтруктураРезультатов.Свойство("CustomsReceiptOrdersInOtherBatches") Тогда
		ДополнительныеСвойства.ТаблицаCustomsReceiptOrdersInOtherBatches = СтруктураРезультатов.CustomsReceiptOrdersInOtherBatches.Выгрузить();
		ДополнительныеСвойства.ТаблицаCustomsReceiptOrdersInOtherBatches.Индексы.Добавить("ТПО");
	КонецЕсли;	
          	
	ДополнительныеСвойства.Вставить("ТаблицаCustomsBondsInOtherBatches", Неопределено);
	Если СтруктураРезультатов.Свойство("CustomsBondsInOtherBatches") Тогда
		ДополнительныеСвойства.ТаблицаCustomsBondsInOtherBatches = СтруктураРезультатов.CustomsBondsInOtherBatches.Выгрузить();
		ДополнительныеСвойства.ТаблицаCustomsBondsInOtherBatches.Индексы.Добавить("CustomsBond");
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ТаблицаCustomsBondClosingsInOtherBatches", Неопределено);
	Если СтруктураРезультатов.Свойство("CustomsBondClosingsInOtherBatches") Тогда
		ДополнительныеСвойства.ТаблицаCustomsBondClosingsInOtherBatches = СтруктураРезультатов.CustomsBondClosingsInOtherBatches.Выгрузить();
		ДополнительныеСвойства.ТаблицаCustomsBondClosingsInOtherBatches.Индексы.Добавить("CustomsBondClosing");
	КонецЕсли;     

КонецПроцедуры

Процедура ПроверитьРеквизитыСДополнительнымиДанными(Отказ, РежимЗаписи)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли; 
	
	// Customs files
	ПроверитьРеквизитыТЧСДополнительнымиДанными(Отказ, 
		"CCDs", "Customs files", "CCD", "Customs file",
		ДополнительныеСвойства.ТаблицаРеквизитовCustomsFiles, "CustomsFile",
		ДополнительныеСвойства.ТаблицаCustomsFilesInOtherBatches);
		
	// дополнительные проверки Customs files
	Для Каждого СтрокаТЧ Из CCDs Цикл
		
		РеквизитыCustomsFile = ДополнительныеСвойства.ТаблицаРеквизитовCustomsFiles.Найти(СтрокаТЧ.CCD, "CustomsFile");
		
		// проверим, что реквизит Shipment - это импортная или экспортная поставка
		Если ТипЗнч(РеквизитыCustomsFile.Shipment) <> Тип("ДокументСсылка.Поставка")
			И ТипЗнч(РеквизитыCustomsFile.Shipment) <> Тип("ДокументСсылка.ExportShipment") Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"In line " + СтрокаТЧ.НомерСтроки + " of Customs files: Customs file is not for Import or Export shipment!",
				ЭтотОбъект, "CCDs[" + (СтрокаТЧ.НомерСтроки-1) + "].CCD", , Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
			
	// Customs files of Temp. imp. / exp.
	ПроверитьРеквизитыТЧСДополнительнымиДанными(Отказ, 
		"CustomsFilesOfTemporaryImportExport", "Customs files of temp. imp./exp.", "CustomsFile", "Customs file",
		ДополнительныеСвойства.ТаблицаРеквизитовCustomsFiles, "CustomsFile",
		ДополнительныеСвойства.ТаблицаCustomsFilesOfTemporaryImportExportInOtherBatches);
		
	// дополнительные проверки Customs files of Temp. imp. / exp.
	Для Каждого СтрокаТЧ Из CustomsFilesOfTemporaryImportExport Цикл
		
		РеквизитыCustomsFile = ДополнительныеСвойства.ТаблицаРеквизитовCustomsFiles.Найти(СтрокаТЧ.CustomsFile, "CustomsFile");
		
		// проверим, что реквизит Shipment - Temp. imp. / exp. transaction
		Если ТипЗнч(РеквизитыCustomsFile.Shipment) <> Тип("ДокументСсылка.TemporaryImpExpTransactions") Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"In line " + СтрокаТЧ.НомерСтроки + " of Customs files: Customs file is not for Temp. imp. / exp. transaction!",
				ЭтотОбъект, "CustomsFilesOfTemporaryImportExport[" + (СтрокаТЧ.НомерСтроки-1) + "].CustomsFile", , Отказ);
			
		КонецЕсли;
		
	КонецЦикла;	
		
	// ТПО
	ПроверитьРеквизитыТЧСДополнительнымиДанными(Отказ, 
		"ТПО", "Customs receipt orders", "ТПО", "Customs receipt order",
		ДополнительныеСвойства.ТаблицаРеквизитовCustomsFilesLight, "CustomsFileLight",
		ДополнительныеСвойства.ТаблицаCustomsReceiptOrdersInOtherBatches);
		
	ПроверитьTypeOfTransactionВТЧ(Отказ, 
		"ТПО", "Customs receipt orders", "ТПО", "Customs receipt order",
		ДополнительныеСвойства.ТаблицаРеквизитовCustomsFilesLight,
		Перечисления.TypesOfCustomsFileLightTransaction.ТПО);	
		
	// Customs bonds
	ПроверитьРеквизитыТЧСДополнительнымиДанными(Отказ, 
		"CustomsBonds", "Customs bonds", "CustomsBond", "Customs bond",
		ДополнительныеСвойства.ТаблицаРеквизитовCustomsFilesLight, "CustomsFileLight",
		ДополнительныеСвойства.ТаблицаCustomsBondsInOtherBatches);

	ПроверитьTypeOfTransactionВТЧ(Отказ, 
		"CustomsBonds", "Customs bonds", "CustomsBond", "Customs bond",
		ДополнительныеСвойства.ТаблицаРеквизитовCustomsFilesLight,
		Перечисления.TypesOfCustomsFileLightTransaction.CustomsBond);	
		
	// Customs bonds closing
	ПроверитьРеквизитыТЧСДополнительнымиДанными(Отказ, 
		"CustomsBondClosings", "Customs bond closings", "CustomsBondClosing", "Customs bond closing",
		ДополнительныеСвойства.ТаблицаРеквизитовCustomsFilesLight, "CustomsFileLight",
		ДополнительныеСвойства.ТаблицаCustomsBondClosingsInOtherBatches);
		
	ПроверитьTypeOfTransactionВТЧ(Отказ, 
		"CustomsBondClosings", "Customs bond closings", "CustomsBondClosing", "Customs bond closing",
		ДополнительныеСвойства.ТаблицаРеквизитовCustomsFilesLight,
		Перечисления.TypesOfCustomsFileLightTransaction.CustomsBondClosing);
		
КонецПроцедуры
	
Процедура ПроверитьРеквизитыТЧСДополнительнымиДанными(Отказ, ИмяТЧ, СинонимТЧ, ИмяРеквизитаТЧ, СинонимРеквизитаТЧ, 
																  ТаблицаРеквизитов, ИмяКолонкиТаблицыРеквизитов, ТаблицаInOtherBatches)
	   			
	Для Каждого СтрокаТЧ Из ЭтотОбъект[ИмяТЧ] Цикл        
			
		Реквизиты = ТаблицаРеквизитов.Найти(СтрокаТЧ[ИмяРеквизитаТЧ], ИмяКолонкиТаблицыРеквизитов);	
		ПрефиксОшибки = "In line " + СтрокаТЧ.НомерСтроки + " of " + СинонимТЧ + ": ";
		Поле = ИмяТЧ + "[" + (СтрокаТЧ.НомерСтроки-1) + "]." + ИмяРеквизитаТЧ;
		
		Если НЕ Реквизиты.Проведен Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ПрефиксОшибки + СинонимРеквизитаТЧ + " is not posted!",
				ЭтотОбъект, Поле, , Отказ);
		КонецЕсли; 
		
		Если Реквизиты.Дата > Дата Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ПрефиксОшибки + "Date " + Формат(Реквизиты.Дата, "ДЛФ=D") + " of " + СинонимРеквизитаТЧ + " is later than the date of the Batch!",
				ЭтотОбъект, Поле, , Отказ);	
		КонецЕсли;
		
		Если Реквизиты.ProcessLevel <> ProcessLevel Тогда   
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ПрефиксОшибки + "Process level '" + СокрЛП(Реквизиты.ProcessLevel) + "' of " + СинонимРеквизитаТЧ + " differs from Process level the Batch!",
				ЭтотОбъект, Поле, , Отказ);	
		КонецЕсли;
		
		Если Реквизиты.ParentCompany <> SoldTo Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ПрефиксОшибки + "Parent company " + СокрЛП(Реквизиты.ParentCompany) + " of " + СинонимРеквизитаТЧ + " differs from Parent company of the Batch!",
				ЭтотОбъект, Поле, , Отказ);	
		КонецЕсли; 
			
		Если НЕ ЗначениеЗаполнено(Реквизиты.InvoiceLinesMatching) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ПрефиксОшибки + "Invoice lines matching not found!",
				ЭтотОбъект, Поле, , Отказ);							
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(Реквизиты.LawsonContractor) Тогда	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ПрефиксОшибки + "Lawson contractor is not defined for Customs '" + СокрЛП(Реквизиты.Customs) + "'!",
				ЭтотОбъект, Поле, , Отказ);	
		КонецЕсли;
		
		СтрокаТаблицыInOtherBatches = ТаблицаInOtherBatches.Найти(СтрокаТЧ[ИмяРеквизитаТЧ], ИмяРеквизитаТЧ);
		Если СтрокаТаблицыInOtherBatches <> Неопределено Тогда				
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ПрефиксОшибки + СинонимРеквизитаТЧ + " is already in the " + СтрокаТаблицыInOtherBatches.BatchOfCustomsFilesПредставление + "!",
				ЭтотОбъект, Поле, , Отказ);			
		КонецЕсли;

	КонецЦикла; 		
			
КонецПроцедуры

Процедура ПроверитьTypeOfTransactionВТЧ(Отказ, ИмяТЧ, СинонимТЧ, ИмяРеквизитаТЧ, СинонимРеквизитаТЧ, ТаблицаРеквизитов, TypeOfTransaction)
	
	Для Каждого СтрокаТЧ Из ЭтотОбъект[ИмяТЧ] Цикл
		
		Реквизиты = ТаблицаРеквизитов.Найти(СтрокаТЧ[ИмяРеквизитаТЧ], "CustomsFileLight");
		
		Если Реквизиты.TypeOfTransaction <> TypeOfTransaction Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"In line " + СтрокаТЧ.НомерСтроки + " of " + СинонимТЧ + ": the document is not " + TypeOfTransaction + "!",
				ЭтотОбъект, ИмяРеквизитаТЧ + "[" + (СтрокаТЧ.НомерСтроки-1) + "]." + ИмяРеквизитаТЧ, , Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
